In [31]:
import pandas as pd
import numpy as np

df = pd.read_csv("salary_sheet_template.csv")
df.head()

df = df.rename(columns={"Name of the employees ":"name","ESI NO":"ESI no",'Basic (55%)': 'Basic', 'P.F.(12%)':'P.F.','ESI (0.75%)': 'ESI ' })
df.head()

,Sl. No,Emp. Code,Name of the employees,Date of Joining,Bank Name,Bank A/C,UAN no,PF no,ESI no,RATE,...,Reimbursement of Expenses,Net Payment (Take Home),EPF (13%),ESI (3.25%),Bonus,Gratuity,LWF.1,CTC of Candidate,Bill CTC,Unnamed: 41
0,1,1000,Shopno Banerjee,01.04.2024,Axis Bank,1234,abcd,1234,NaN,"25,000",...,-,"23,220","1,788",0,0,0,0,"26,788","26,788",NaN
1,2,1001,Shopno Banerjee,01.04.2024,Axis Bank,1234,abcd,1234,NaN,"25,000",...,-,"23,220","1,788",0,0,0,0,"26,788","26,788",NaN
2,3,1002,Shopno Banerjee,01.04.2024,Axis Bank,1234,abcd,1234,NaN,"25,000",...,-,"23,220","1,788",0,0,0,0,"26,788","26,788",NaN
3,4,1003,Shopno Banerjee,01.04.2024,Axis Bank,1234,abcd,1234,NaN,"25,000",...,-,"23,220","1,788",0,0,0,0,"26,788","26,788",NaN
4,5,1004,Shopno Banerjee,01.04.2024,Axis Bank,1234,abcd,1234,NaN,"25,000",...,-,"23,220","1,788",0,0,0,0,"26,788","26,788",NaN

In [32]:
df.columns

Index(['Sl. No', 'Emp. Code', 'Name of the employees', 'Date of Joining',
       'Bank Name', 'Bank A/C', 'UAN no', 'PF no', 'ESI no', 'RATE', 'Basic',
       'HRA (35%)', 'conveyance (5%)', 'Washing (5%)', 'Total', 'Month Days',
       'Actual', 'Leave', 'Total.1', 'OT (in Days)', 'Basic ', 'HRA ',
       'conveyance', 'Washing', 'OT', 'TOTAL', 'P.T.', 'P.F.', 'ESI ', 'LWF',
       'Adv.', 'Total.2', 'Reimbursement of Expenses',
       'Net Payment (Take Home)', 'EPF (13%)', 'ESI (3.25%)', 'Bonus',
       'Gratuity', 'LWF.1', 'CTC of Candidate', 'Bill CTC', 'Unnamed: 41'],
      dtype='object')

In [33]:
df=df[['Emp. Code', 'Name of the employees','Actual','Basic', 'HRA ', 'conveyance', 'Washing','OT', 'TOTAL','P.T.', 'P.F.', 'ESI ','Adv.', 'Total.2']]
df=df.astype(str)
df

,Emp. Code,Name of the employees,Actual,Basic,HRA,conveyance,Washing,OT,TOTAL,P.T.,P.F.,ESI,Adv.,Total.2
0,1000,Shopno Banerjee,30,"13,750","8,750","1,250","1,250",-,"25,000",130,"1,650",-,nan,"1,780"
1,1001,Shopno Banerjee,30,"13,750","8,750","1,250","1,250",-,"25,000",130,"1,650",-,nan,"1,780"
2,1002,Shopno Banerjee,30,"13,750","8,750","1,250","1,250",-,"25,000",130,"1,650",-,nan,"1,780"
3,1003,Shopno Banerjee,30,"13,750","8,750","1,250","1,250",-,"25,000",130,"1,650",-,nan,"1,780"
4,1004,Shopno Banerjee,30,"13,750","8,750","1,250","1,250",-,"25,000",130,"1,650",-,nan,"1,780"

In [36]:


columns = [['Emp. Code', 'Name of the employees','Actual','Basic', 'HRA ', 'conveyance', 'Washing',
       'OT', 'TOTAL','P.T.', 'P.F.', 'ESI ','Adv.', 'Total.2']]

listy=[]
for index, row in df.iterrows():
    words=" "
    list=[]
    for col in columns:

        words = words + ' '.join(row[col])+' '
        list=words.split()
        listy.append(list)
        print(list)

print(listy)

    
    # for col in genre:
    #     row[col] = row[col].replace('[', '').replace(']', '').replace('\'', '')
    #     row[col] = row[col].replace(',', ' ')
    #     words = words + ''.join(row[col])+' '
    # for col in name:
    #     row[col] = row[col].replace(',', ' ')
    #     words = words + ' '.join(row[col])+' '

    # for col in keyword:
    #     words = words + ' '.join(row[col])+ ' '
    # for col in prod:    
    #     row[col] = row[col].replace('[', '').replace(']', '').replace('\'', '')
    # for col in scores:
    #     words = words + str(int(row[col]))
    # df.at[index,'bag_of_words'] = words.lower()
# df.head()

['1000', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']
['1001', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']
['1002', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']
['1003', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']
['1004', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']
[['1000', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780'], ['1001', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780'], ['1002', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780'], ['1003', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780'], ['1004', 'Shopno', 'Banerjee', '30', '13,750', '8,750', '1,250', '1,250', '-', '25,000', '130', '1,650', '-', 'nan', '1,780']]